"use client"

import Header from "@/components/common/Header";
import AboutUs from "@/components/main_page/AboutUs";
import Introduction from "@/components/main_page/Introduction";
import MovieList from "@/components/main_page/MovieList";
import { alertSmth, BACKEND_API_URL } from "@/components/services/nonComponents";
import { useEffect, useState } from "react";

const NOW_IN_PROCAT = "Зараз у прокаті"
const MAIN_PAGE = "Головна сторінка"
const BAD_FETCH_FILMS_DATA = "Помилка завантаження списку фільмів!"

const FAKE_FILMS_DATA = [
  {
      id: 1,
      uk_name: "Полювання1",
      en_name: "The Hunt",
      release_year: 2012,
      countries: ["Данія", "Швеція"],
      genres: ["Фільми", "Драми"],
      director: "Томас Вінтерберґ",
      src_poster: "https://uakino.me/uploads/posts/2018-02/1517680168_1.jpg",
      src_photos: [
          "https://uakino.me/uploads/posts/2017-10/TheHunt/5dbjyrbe.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/42p0j1zh.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/p12y2pkx.jpg"
      ],
      actors: [
          "Мадс Міккельсен", 
          "Томас Бо Ларсен",
          "Анніка Веддеркопп",
          "Ласе Фоґельстрьом",
          "Сусе Волд",
          "Анне Луізе Гасінґ"
      ],
      duration: 1488,
      voice_acting: "Український (Цікава Ідея)",
      rating: {
          imdb: "8.3/328 000"
      },
      age_limit: "12+",
      about: "Психологічний фільм «Полювання», знятий данцем Томасом Вінтербергом, розповідає історію вигнанця і показує, як людське безумство може бути заразним. Люди звикли вірити натовпу, і не реагують на докази та каяття. Все, що намагається сказати у відповідь вигнанець, сприймається як спроба виправдати себе. Ця вузьколобість людей руйнує долі невинних, що виявилися жертвами дивних, непередбачуваних обставин. У крихітному данському селі живе сорокарічний Лукас. Після розлучення і боротьби за сина підлітка, який вирішив залишитися з ним, він пішов з ліцею і став вихователем в дитсадку. Привабливий Лукас не обділений увагою: у нього навіть закохується його вихованка - п'ятирічна дівчинка Клара. Одного разу дівчинка намагається його поцілувати, і Лукас не стримуючи себе грубить дівчинці. «Покинута» Клара придумує і здійснює блискучий план помсти вихователю. На те, що доводиться пережити Лукасу, емоційно дивитися важко. І навіть після визнання його невинності в суді, суспільство продовжує жорстоке полювання на вигнанця ..."
  },
  {
      id: 2,
      uk_name: "Полювання2",
      en_name: "The Hunt",
      release_year: 2012,
      countries: ["Данія", "Швеція"],
      genres: ["Фільми", "Драми"],
      director: "Томас Вінтерберґ",
      src_poster: "https://uakino.me/uploads/posts/2018-02/1517680168_1.jpg",
      src_photos: [
          "https://uakino.me/uploads/posts/2017-10/TheHunt/5dbjyrbe.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/42p0j1zh.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/p12y2pkx.jpg"
      ],
      actors: [
          "Мадс Міккельсен", 
          "Томас Бо Ларсен",
          "Анніка Веддеркопп",
          "Ласе Фоґельстрьом",
          "Сусе Волд",
          "Анне Луізе Гасінґ"
      ],
      duration: 1488,
      voice_acting: "Український (Цікава Ідея)",
      rating: {
          imdb: "8.3/328 000"
      },
      age_limit: "12+",
      about: "Психологічний фільм «Полювання», знятий данцем Томасом Вінтербергом, розповідає історію вигнанця і показує, як людське безумство може бути заразним. Люди звикли вірити натовпу, і не реагують на докази та каяття. Все, що намагається сказати у відповідь вигнанець, сприймається як спроба виправдати себе. Ця вузьколобість людей руйнує долі невинних, що виявилися жертвами дивних, непередбачуваних обставин. У крихітному данському селі живе сорокарічний Лукас. Після розлучення і боротьби за сина підлітка, який вирішив залишитися з ним, він пішов з ліцею і став вихователем в дитсадку. Привабливий Лукас не обділений увагою: у нього навіть закохується його вихованка - п'ятирічна дівчинка Клара. Одного разу дівчинка намагається його поцілувати, і Лукас не стримуючи себе грубить дівчинці. «Покинута» Клара придумує і здійснює блискучий план помсти вихователю. На те, що доводиться пережити Лукасу, емоційно дивитися важко. І навіть після визнання його невинності в суді, суспільство продовжує жорстоке полювання на вигнанця ..."
  },
  {
      id: 3,
      uk_name: "Полювання3",
      en_name: "The Hunt",
      release_year: 2012,
      countries: ["Данія", "Швеція"],
      genres: ["Фільми", "Драми"],
      director: "Томас Вінтерберґ",
      src_poster: "https://uakino.me/uploads/posts/2018-02/1517680168_1.jpg",
      src_photos: [
          "https://uakino.me/uploads/posts/2017-10/TheHunt/5dbjyrbe.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/42p0j1zh.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/p12y2pkx.jpg"
      ],
      actors: [
          "Мадс Міккельсен", 
          "Томас Бо Ларсен",
          "Анніка Веддеркопп",
          "Ласе Фоґельстрьом",
          "Сусе Волд",
          "Анне Луізе Гасінґ"
      ],
      duration: 1488,
      voice_acting: "Український (Цікава Ідея)",
      rating: {
          imdb: "8.3/328 000"
      },
      age_limit: "12+",
      about: "Психологічний фільм «Полювання», знятий данцем Томасом Вінтербергом, розповідає історію вигнанця і показує, як людське безумство може бути заразним. Люди звикли вірити натовпу, і не реагують на докази та каяття. Все, що намагається сказати у відповідь вигнанець, сприймається як спроба виправдати себе. Ця вузьколобість людей руйнує долі невинних, що виявилися жертвами дивних, непередбачуваних обставин. У крихітному данському селі живе сорокарічний Лукас. Після розлучення і боротьби за сина підлітка, який вирішив залишитися з ним, він пішов з ліцею і став вихователем в дитсадку. Привабливий Лукас не обділений увагою: у нього навіть закохується його вихованка - п'ятирічна дівчинка Клара. Одного разу дівчинка намагається його поцілувати, і Лукас не стримуючи себе грубить дівчинці. «Покинута» Клара придумує і здійснює блискучий план помсти вихователю. На те, що доводиться пережити Лукасу, емоційно дивитися важко. І навіть після визнання його невинності в суді, суспільство продовжує жорстоке полювання на вигнанця ..."
  },
  {
      id: 4,
      uk_name: "Полювання4",
      en_name: "The Hunt",
      release_year: 2012,
      countries: ["Данія", "Швеція"],
      genres: ["Фільми", "Драми"],
      director: "Томас Вінтерберґ",
      src_poster: "https://uakino.me/uploads/posts/2018-02/1517680168_1.jpg",
      src_photos: [
          "https://uakino.me/uploads/posts/2017-10/TheHunt/5dbjyrbe.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/42p0j1zh.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/p12y2pkx.jpg"
      ],
      actors: [
          "Мадс Міккельсен", 
          "Томас Бо Ларсен",
          "Анніка Веддеркопп",
          "Ласе Фоґельстрьом",
          "Сусе Волд",
          "Анне Луізе Гасінґ"
      ],
      duration: 1488,
      voice_acting: "Український (Цікава Ідея)",
      rating: {
          imdb: "8.3/328 000"
      },
      age_limit: "12+",
      about: "Психологічний фільм «Полювання», знятий данцем Томасом Вінтербергом, розповідає історію вигнанця і показує, як людське безумство може бути заразним. Люди звикли вірити натовпу, і не реагують на докази та каяття. Все, що намагається сказати у відповідь вигнанець, сприймається як спроба виправдати себе. Ця вузьколобість людей руйнує долі невинних, що виявилися жертвами дивних, непередбачуваних обставин. У крихітному данському селі живе сорокарічний Лукас. Після розлучення і боротьби за сина підлітка, який вирішив залишитися з ним, він пішов з ліцею і став вихователем в дитсадку. Привабливий Лукас не обділений увагою: у нього навіть закохується його вихованка - п'ятирічна дівчинка Клара. Одного разу дівчинка намагається його поцілувати, і Лукас не стримуючи себе грубить дівчинці. «Покинута» Клара придумує і здійснює блискучий план помсти вихователю. На те, що доводиться пережити Лукасу, емоційно дивитися важко. І навіть після визнання його невинності в суді, суспільство продовжує жорстоке полювання на вигнанця ..."
  },
  {
      id: 5,
      uk_name: "Полювання5",
      en_name: "The Hunt",
      release_year: 2012,
      countries: ["Данія", "Швеція"],
      genres: ["Фільми", "Драми"],
      director: "Томас Вінтерберґ",
      src_poster: "https://uakino.me/uploads/posts/2018-02/1517680168_1.jpg",
      src_photos: [
          "https://uakino.me/uploads/posts/2017-10/TheHunt/5dbjyrbe.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/42p0j1zh.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/p12y2pkx.jpg"
      ],
      actors: [
          "Мадс Міккельсен", 
          "Томас Бо Ларсен",
          "Анніка Веддеркопп",
          "Ласе Фоґельстрьом",
          "Сусе Волд",
          "Анне Луізе Гасінґ"
      ],
      duration: 1488,
      voice_acting: "Український (Цікава Ідея)",
      rating: {
          imdb: "8.3/328 000"
      },
      age_limit: "12+",
      about: "Психологічний фільм «Полювання», знятий данцем Томасом Вінтербергом, розповідає історію вигнанця і показує, як людське безумство може бути заразним. Люди звикли вірити натовпу, і не реагують на докази та каяття. Все, що намагається сказати у відповідь вигнанець, сприймається як спроба виправдати себе. Ця вузьколобість людей руйнує долі невинних, що виявилися жертвами дивних, непередбачуваних обставин. У крихітному данському селі живе сорокарічний Лукас. Після розлучення і боротьби за сина підлітка, який вирішив залишитися з ним, він пішов з ліцею і став вихователем в дитсадку. Привабливий Лукас не обділений увагою: у нього навіть закохується його вихованка - п'ятирічна дівчинка Клара. Одного разу дівчинка намагається його поцілувати, і Лукас не стримуючи себе грубить дівчинці. «Покинута» Клара придумує і здійснює блискучий план помсти вихователю. На те, що доводиться пережити Лукасу, емоційно дивитися важко. І навіть після визнання його невинності в суді, суспільство продовжує жорстоке полювання на вигнанця ..."
  },
  {
      id: 6,
      uk_name: "Полювання6",
      en_name: "The Hunt",
      release_year: 2012,
      countries: ["Данія", "Швеція"],
      genres: ["Фільми", "Драми"],
      director: "Томас Вінтерберґ",
      src_poster: "https://uakino.me/uploads/posts/2018-02/1517680168_1.jpg",
      src_photos: [
          "https://uakino.me/uploads/posts/2017-10/TheHunt/5dbjyrbe.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/42p0j1zh.jpg",
          "https://uakino.me/uploads/posts/2017-10/TheHunt/p12y2pkx.jpg"
      ],
      actors: [
          "Мадс Міккельсен", 
          "Томас Бо Ларсен",
          "Анніка Веддеркопп",
          "Ласе Фоґельстрьом",
          "Сусе Волд",
          "Анне Луізе Гасінґ"
      ],
      duration: 1488,
      voice_acting: "Український (Цікава Ідея)",
      rating: {
          imdb: "8.3/328 000"
      },
      age_limit: "12+",
      about: "Психологічний фільм «Полювання», знятий данцем Томасом Вінтербергом, розповідає історію вигнанця і показує, як людське безумство може бути заразним. Люди звикли вірити натовпу, і не реагують на докази та каяття. Все, що намагається сказати у відповідь вигнанець, сприймається як спроба виправдати себе. Ця вузьколобість людей руйнує долі невинних, що виявилися жертвами дивних, непередбачуваних обставин. У крихітному данському селі живе сорокарічний Лукас. Після розлучення і боротьби за сина підлітка, який вирішив залишитися з ним, він пішов з ліцею і став вихователем в дитсадку. Привабливий Лукас не обділений увагою: у нього навіть закохується його вихованка - п'ятирічна дівчинка Клара. Одного разу дівчинка намагається його поцілувати, і Лукас не стримуючи себе грубить дівчинці. «Покинута» Клара придумує і здійснює блискучий план помсти вихователю. На те, що доводиться пережити Лукасу, емоційно дивитися важко. І навіть після визнання його невинності в суді, суспільство продовжує жорстоке полювання на вигнанця ..."
  }
]

export default function Home() {
    const [filmsData, setFilmsData] = useState([])

    async function fetchFilmsData() {
        try {
            const response = await fetch(`${BACKEND_API_URL}/films/with_sessions`)

            if (!response.ok) {
                message = await response.text()
                throw new Error(message)
            }

            const films = await response.json()
            setFilmsData(films)
        } catch (err) {
            alertSmth(JSON.parse(err.message).message ?? BAD_FETCH_FILMS_DATA)
        }
    }

    useEffect(() => {
        fetchFilmsData()
    }, [])

    return (
    <div className="">
        <Introduction />
        <Header headText={filmsData.length ? NOW_IN_PROCAT : MAIN_PAGE} />
        <main className="bg-[url(/images/2025-04-09_20.25.22.png)] bg-cover bg-center bg-fixed">
            <div className="backdrop-blur-xs backdrop-grayscale-100">
                {filmsData.length > 0 && <MovieList list={filmsData} />}
                <AboutUs />
            </div>
        </main>
    </div>
    );
}
